// Home work 2
/*
Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на 
выходе показывает вторую цифру этого числа.

456 -> 5
782 -> 8
918 -> 1
*/
//              123546           3
int FindNum(int number, int razryd)
{
   string numST =  ;
   Console.WriteLine($" {number}");
   return 0;
}
Console.Clear();
Console.Write("Ведите число для разбора: ");
int number = Convert.ToInt32(Console.ReadLine());
Console.Write("Ведите номер разряда: ");
int razryd = Convert.ToInt32(Console.ReadLine());

FindNum(number, razryd);
/*
Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.

645 -> 5

78 -> третьей цифры нет

32679 -> 6

Задача 15: Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.

6 -> да
7 -> да
1 -> нет
*/